[M_PoeticLicense MissionDefinition]
MissionDescription="Scooter wants to write romance, but needs inspiration. He asks you to explore Pandora and find something natural (or unnatural) that will inspire him to finish the poem and win the heart of a girl named Daisy.. "
TurnInDescription="Everyone comes to visit.."

[M_PoeticLicense:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Scooter wants to write a love song. But it needs motivation.. He asked to find Pandora and got a physical clue. (or unnatural) It leads him to complete a poem and win the heart of a girl named Daisy.. You have all my favorite poems. Now you must return to him and give the poem. And she gave him a daisy."

[M_PoeticLicense:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Scooter wants to write a love song, but needs inspiration. He wants you to find a natural (or unnatural) sign that will inspire you to find Pandora, fulfill your destiny, and win the heart of a woman named Daisy.. At the end of the song, Scooter asks Daisy to introduce him.."
